Heat Transfer/sphere_in_air_extended/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       latestTime;

startTime       0.8;

stopAt          endTime;

endTime         3;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo           0.99;

maxDi           10.0;

adjustTimeStep  yes;
functions
{
   wallHeatFlux1
	{
	type 		wallHeatFlux;
	libs		("libfieldFunctionObjects.so");
	executeControl	writeTime;
	writeControl	writeTime;
	region		air;
	}
   sphereHeatTrfCoeff
	{
	type 		heatTransferCoeff;
	libs		("libfieldFunctionObjects.so");
	executeControl  writeTime;
        writeControl    writeTime;
	region		air;
	patches		("air_to_sphere");
	field		T;
	
	htcModel	fixedReferenceTemperature;
	TRef		300;		
	}
   
   avgSphereHeatTrfCoeff
	{
	type 		surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");
	
        executeControl  writeTime;
        writeControl    writeTime;
	writeFields	yes;
	fields
	(
	heatTransferCoeff(T)
	T
	);
	
	regionType	patch;
	name		air_to_sphere;
	operation	areaAverage;	
	region		air;	
	surfaceFormat	none;

	}

}

// ************************************************************************* //
