Heat Transfer/sphere_in_air_extended/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;



geometry
{
    sphere.stl
    {
        type triSurfaceMesh;
        scale 0.001;
        name cylinder;
    }

    refinementBox
    {
	type            searchableBox;
        min  		(-0.05 -0.1 -1);
        max 		(0.05 1 1);
		
   }
};



castellatedMeshControls
{

    
    maxLocalCells 100000;

    
    maxGlobalCells 2000000;

    
    minRefinementCells 10;

    
    nCellsBetweenLevels 15;


//surface feature extract
    features
    (
 	{
		file "sphere.extendedFeatureEdgeMesh";
                level 3;
	}
       
    );



    refinementSurfaces
    {
        cylinder
       {
            // Surface-wise min and max refinement level
            level (4 4);
          patchInfo
		 {
			 type wall;
		 }
        }
    }

    
    resolveFeatureAngle 30;


    // Region-wise refinement
   

    refinementRegions
    {
       refinementBox
       {
           mode inside;
           levels ((0.05 1));
        }
    }


    // Mesh selection
    
    locationsInMesh 
    (
        (( 0.0001 0.0001  0.0001) sphere)
        (( 0.052631  0.058706  0.001) air)
        
    );


    
    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
   
    nSmoothPatch 3;

    
    tolerance 2.0;

   
    nSolveIter 30;

   
    nRelaxIter 5;

   
    nFeatureSnapIter 10;

    implicitFeatureSnap false;

    explicitFeatureSnap true;
 
     multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    relativeSizes true; //false,usulaly with first layer thickness

    
    layers
    {
         // maxY
       // {
       //     nSurfaceLayers 0;
       // }
	//minY
      //  {
       //     nSurfaceLayers 0;
       // }
	//minX
     //   {
     //       nSurfaceLayers 0;
     //   }
	// maxX
      //  {
    //        nSurfaceLayers 0;
    //    }
//	minZ
   //     {
   //         nSurfaceLayers 0;
   //     }
//	maxZ
  //      {
  //          nSurfaceLayers 0;
  //      }
	//sphere_to_air
   //    {
    //       nSurfaceLayers 5;
     //      expansionRatio 1.3;
    //   }

	air_to_sphere
       {
            nSurfaceLayers 5;
	    expansionRatio 1.2;
     }
    
    }
   
    expansionRatio 1.2;

    
    finalLayerThickness 0.5;

    
    minThickness 0.01;

    
    nGrow 0;

    
    featureAngle 30;

    
    nRelaxIter 3;

   
    nSmoothSurfaceNormals 1;

    
    nSmoothNormals 3;

    
    nSmoothThickness 10;

   
    maxFaceThicknessRatio 0.5;

   
    maxThicknessToMedialRatio 0.3;

    
    minMedialAxisAngle 90;

   
    nBufferCellsNoExtrude 0;

    
    nLayerIter 50;
}




meshQualityControls
{
    #include "meshQualityDict"

    
    nSmoothScale 4;
   
    errorReduction 0.75;
}




mergeTolerance 1e-6;


// ************************************************************************* //
