Heat Transfer/sphere_in_air_extended/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    maxY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1800;
        startFace       2252118;
    }

    minX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          2136;
        startFace       2253918;
    }

    maxX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          2136;
        startFace       2256054;
    }

    minY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1236;
        startFace       2258190;
    }

    minZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          3474;
        startFace       2259426;
    }

    maxZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          3474;
        startFace       2262900;
    }

    air_to_sphere
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          10824;
        startFace       2266374;
        sampleMode      nearestPatchFace;
        sampleRegion    sphere;
        samplePatch     sphere_to_air;
    }

)


// ************************************************************************* //
