Heat Transfer/sphere_in_air_extended/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1800;
        startFace       2425182;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2136;
        startFace       2426982;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2136;
        startFace       2429118;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1236;
        startFace       2431254;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3474;
        startFace       2432490;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3474;
        startFace       2435964;
    }
)

// ************************************************************************* //
