Heat Transfer/sphere_in_air_extended/constant/sphere/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/sphere/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1
(
    sphere_to_air
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          10824;
        startFace       162240;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_sphere;
    }

)


// ************************************************************************* //
