Heat Transfer/sphere_in_air_extended/system/sphere/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
}

T
{
    internalField   uniform 500;

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }
       // "procBoundary.*"
       // {
       //     type            processor;
      //  }
        "sphere_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 500;
        }
    }

  // sphere_to_air
   // {
    //    type            calculated;
    //    value           uniform 1e5;
  //  } 
}

// ************************************************************************* //
